UPDATE products SET description = '6-ядерный процессор AMD Ryzen 5 3600 OEM порадует
 высоким уровнем производительности подавляющее большинство пользователей. Устройство
 будет уверенно себя чувствовать в составе мощной игровой системы. Базовая частота процессора
 равна 3600 МГц. Турбочастота – 4200 МГц. Важной особенностью процессора является очень
 большой объем кэша третьего уровня: величина этого показателя равна 32 МБ.
 Объем кэша L2 – 3 МБ. Процессор AMD Ryzen 5 3600 OEM не имеет встроенного графического ядра. 
 Модель совместима с памятью DDR4, объем которой может достигать 128 ГБ.
 Минимально допустимая частота оперативной памяти – 1600 МГц.
 Максимально допустимая частота вдвое выше – 3200 МГц. \r\nПроцессор не укомплектован 
 системой охлаждения. Выбор кулера предоставлен производителем пользователю. 
 Несмотря на высокий уровень эксплуатационных параметров, процессор отличается 
 незначительным (лишь 65 Вт) показателем TDP. 
 Для установки устройства используется сокет AM4.'
where id = 1;
GO

UPDATE products SET description = 'Оперативная память AMD Radeon R5 
 Entertainment Series объемом 8 ГБ принадлежит типу DDR3. Она предназначена 
 для обеспечения работоспособности стандартного домашнего или офисного компьютера, 
 не имеющего сверхнагрузок.\r\nМодель представлена одним модулем с тактовой частотой 
 1600 МГц и пропускной способностью PC12800. Поддерживаемые моделью режимы работы – 
 это 1066, 1333, 1600 МГц. Высота модуля оперативной памяти составляет 3 см.
 Показатель напряжения питания AMD Radeon R5 Entertainment Series составляет 1.5 В.
 Форм-фактор представленной оперативной памяти – DIMM.' 
where id = 2;
GO

UPDATE products SET description = 'Планшет Apple iPad 2020 Wi-Fi станет вашим 
 блокнотом для записей, мобильным офисом, фотостудией, игровой приставкой и даже
 личным кинотеатром. Мощности процессора A12 Bionic достаточно и для важных приложений,
 и для увлекательных игр. Редактируйте тексты, ищите в интернете и одновременно
 общайтесь с коллегами по FaceTime. С Apple Pencil делать заметки на iPad просто 
 как никогда. Добавьте полноразмерную клавиатуру Smart Keyboard для удобного
 набора текста. Подключайтесь по сети Wi-Fi. Пользуйтесь Apple iPad 2020 Wi-Fi
 весь день без подзарядки.'
 where id = 3;
GO

UPDATE products SET description = 'Монитор Acer 23.8\" K242HYLBBD с 
 трехсторонним безрамочным дизайном поддерживает диагональ экрана 23.6\".
 Технологи VA с откликом 4 мс позволяет этому аппарату стать незаменимым 
 для повседневного пользования: вы можете свободно работать в офисных 
 программах, просматривать веб-страницы, фото или смотреть видео.
 Частота обновления на уровне 60 Гц не допустит задержек при выполнении 
 даже сложных задач, требующих более высокой отдачи.\r\nИзображение на 
 экран Acer 23.8\" K242HYLBBD выводится в разрешении 1920x1080, 
 при этом показатели контрастности и яркости соответствуют 3000:1 и 250 Кд/м².
 Это позволяет получить качественную картинку с четкими границами.
 Расширенные углы просмотра 178°/178° помогут сохранить четкость изображения,
 с какой бы стороны комнаты вы ни смотрели на экран. Для подключения
 видеотехники монитор использует разъемы VGA (D-sub), DVI-D,
 расположенные на задней стороне корпуса.'
where id = 4;
GO

UPDATE products SET description = 'Процессор Intel Core i5-10400F OEM 
 способен проявить свою эффективность в составе игровых систем и
 мощных рабочих станций. Графическое ядро отсутствует: вам будет
 нужно позаботиться о выборе видеокарты. Базовая частота процессора
 равна 2900 МГц. Пиковая частота в турборежиме намного выше – 4300 МГц. 
 Процессор обладает 12-мегабайтной кеш-памятью третьего уровня. Объем 
 кеша L2 равен 1.5 МБ. Совместимая память – DDR4.\r\nПроцессор Intel 
 Core i5-10400F OEM не укомплектован кулером. При выборе устройства 
 теплоотвода вы с высочайшей долей вероятности не испытаете трудностей. 
 Дело в данном случаев в незначительной величине показателя TDP (65 Вт).
 Тип сокета устройства – LGA 1200.'
where id = 5;
GO

UPDATE products SET description = 'Видеокарта GIGABYTE GeForce 
 RTX 3060 GAMING OC Rev2.0 способна гарантировать возможность
 комфортного использования большинства видеоигр. Главный компонент
 видеоадаптера – видеопроцессор GeForce RTX 3060. Устройство не
 располагает поддержкой мультипроцессорной конфигурации.'
where id = 6;
GO

UPDATE products SET description = 'Принтер лазерный Kyocera ECOSYS P2040dn 
 – оптимальное решение для офиса, когда на печать за день отправляется 
 достаточное количество документов. Это лазерного типа устройство, 
 оно надежно, экономично, дарит вам отличное качество черно-белой печати.
 Максимальное разрешение печати составляет 1200x1200 dpi, 
 скорость же достигает показателя 40 стр/мин, при этом время 
 выхода первого отпечатка – всего 6.4 с. Для удобства и экономии 
 времени и бумаги устройством предусмотрена возможность автоматической 
 двусторонней печати.\r\nВ месяц Kyocera ECOSYS P2040dn способен выдать
 до 50000 страниц, а ресурс черного картриджа составляет 7200 страниц.
 60 - 220 г/м2 – такова плотность носителей, на которых вы можете 
 выводить изображение. В качестве носителей допускается использовать
 матовую и глянцевую бумагу, фотобумагу, этикетки и наклейки. 
 С помощью интерфейса Ethernet (RJ-45) вы можете сделать из принтера 
 сетевое устройство, также возможна печать с мобильных устройств.
 В комплект входит картридж с тонером на 3600 страниц.' 
where id = 7;
GO

UPDATE products SET description = 'Жесткий диск WD Caviar Blue WD10EZEX 1 Тб
 сочетает в себе лучшие наработки компании Western Digital. 
 Гарантированный длительный срок эксплуатации, надежность в использовании, 
 высокая скорость записи и чтения – все это характерно для этой модели.
 \r\n\r\nWD Caviar Blue WD10EZEX 1 Тб позволит хранить сотни часов музыки 
 и видео, устанавливать множество приложений и игр, обеспечит быстрый 
 доступ к хранимым данным. Все это - благодаря скорости вращения 7200 
 оборотов в минуту и технологии NCQ.\r\n\r\nЖесткий диск способен 
 удовлетворить любые требования пользователя. Во время работы он практически
 не издает шумов, а о вибрации не может быть и речи. Идеальный выбор
 для длительного и надежного использования.'
where id = 8;
GO

UPDATE products SET description = 'Это iPhone 12. Великолепный яркий дисплей 
 Super Retina XDR 6,1 дюйма. Передняя панель Ceramic Shield, с 
 которой риск повреждений дисплея при падении\r\nв 4 раза ниже. 
 Потрясающее качество снимков при слабом освещении благодаря Ночному
 режиму на всех камерах. Съёмка, монтаж и воспроизведение видео
 кинематографического качества в стандарте Dolby Vision. Мощный
 процессор A14 Bionic. И аксессуары MagSafe, которые мгновенно 
 примагничиваются\r\nи обеспечивают более быструю беспроводную зарядку. 
 Другими словами, вас ждут яркие открытия.'
where id = 9;
GO

UPDATE products SET description = 'Материнская плата MSI Z490-A PRO 
 оптимальна при сборке производительного компьютера, в том числе – 
 игровой системы. Модель базируется на высокопроизводительном чипсете
 Intel Z490. Тип сокета – LGA 1200. Плата обладает поддержкой технологии 
 CrossFire X. Эта особенность с высокой долей вероятности будет оценена 
 любителями видеоигр. Дополнить мощные процессор и видеокарту производительными
 накопителями вы сможете, воспользовавшись M.2 SSD. 
 Количество разъемов M.2 – 2.\r\nФорм-фактор платы MSI Z490-A 
 PRO – Standard-ATX. Такие платы в подавляющем большинстве случаев
 обладают необходимым для существенного расширения функциональных 
 возможностей системы количеством слотов расширения. Рассматриваемая 
 модель не является исключением: в вашем распоряжении будут 2 слота 
 PCI-E x16 и 3 слота PCI-E x1. Штатное оснащение платы – звуковой адаптер
 7.1 и сетевой адаптер Realtek RTL8125-CG, обеспечивающий скорость 2500 Мбит/с.'
where id = 10;
GO

UPDATE products SET description = 'Принтер лазерный HP Laser 107r вполне может
 использоваться в офисе для черно-белой печати документов, бланков квитанций, 
 этикеток. Для этого можно использовать разные типы бумаги: тонкую, плотную,
 переработанную, цветную и другие. Плотность бумаги может варьироваться в 
 диапазоне 60 - 163 г/м². За счет лазерной технологии печати поддерживается
 ее высокая скорость (20 стр/мин) и четкость (1200x1200 dpi) отпечатанных 
 документов. В конструкции принтера предусмотрено наличие лотка подачи,
 рассчитанного на 150 листов формата А4 и выходного лотка на 100 листов.
 \r\nВ принтер лазерный HP Laser 107r устанавливается один картридж этого 
 же производителя, что в свою очередь обеспечит эффективность печати.
 Технические параметры принтера обеспечивают возможность печати большого 
 объема документов, до 10000 стр/месяц. Подключается принтер к ПК через 
 интерфейс USB 2.0. Диск с ПО в комплекте с принтером позволит выполнить
 его синхронизацию с ПК достаточно легко и быстро. Кроме того, принтер 
 совместим с ОС Windows. Информация о текущем состоянии принтера отображается
 при помощи индикаторов на его корпусе.'
where id = 11;
GO

UPDATE products SET description = 'Процессор AMD Ryzen 5 3500X OEM 
 может быть полезен при комплектации игрового компьютера высокого класса. 
 Вычислительное устройство способно проявить свою эффективность и в 
 составе производительной рабочей станции. Базовая частота процессора
 равна 3600 МГц. Наибольшая частота в турборежиме – 4100 МГц. Одним 
 из преимуществ модели является значительный (32 МБ) объем кеш-памяти 
 L3.\r\nПроцессор AMD Ryzen 5 3500X OEM не имеет встроенного графического
 ядра. Это легко объяснить, ведь эксплуатация устройства подразумевается
 совместно с мощной видеокартой (или несколькими видеокартами). Системы 
 охлаждения в комплекте нет. Выбрать кулер вы сможете, основываясь на 
 личных предпочтениях. В процессе выбора нужно учитывать показатель TDP
 процессора, составляющий 65 Вт. Максимально поддерживаемый объем памяти – 128 ГБ.
 Процессор имеет поддержку ECC.'
where id = 12;
GO

UPDATE products SET description = 'Видеокарта Palit GeForce 
 GTX 1660 DUAL [NE51660018J9-1161C] предназначена для использования 
 в мощных компьютерных системах, при этом обладает компактными размерами. 
 Графический процессор на архитектуре Turing работает с тактовой частотой 
 1530 МГц, повышаемой до показателя 1785 МГц в режиме вычислительного разгона.
 Данная версия графического адаптера располагает 6 ГБ памяти стандарта GDDR5 
 с пропускной способностью 8 Гбит/с.\r\nВидеокарта Palit GeForce GTX 1660 DUAL
 [NE51660018J9-1161C] занимает два слота расширения на материнской плате и
 оборудована активной системой охлаждения на основе двух осевых вентиляторов.
 Из интерфейсов имеются по одному разъему DVI-D, HDMI и DisplayPort. 
 Для стабильной работы требуется подключение дополнительного питания 
 посредством разъема 8-pin.'
where id = 13;
GO

UPDATE products SET description = 'Монитор Samsung S24F354FHI [LS24F354FHIXCI] с
 диагональю 23.5 дюйма способствует отображению детализированной и контрастной 
 картинки, лишенной малейших искажений, поскольку в его основу положена матрица
 PLS. Благодаря сниженному до 4 мс времени отклика пикселя вы не столкнетесь с 
 зависанием кадров при отображении наиболее динамичных и насыщенных сцен. 
 Смотрите любимый контент даже в большой компании, ведь углы обзора в данном 
 устройстве увеличены до 178 градусов.\r\nВ основании Samsung S24F354FHI 
 [LS24F354FHIXCI] появилась прочная подставка, обеспечивающая устойчивость
 на любой поверхности. Благодаря регулируемому механизму вы без труда подберете
 желаемый угол наклона устройства. Матовое покрытие предупредит постоянное
 оседание частиц пыли и загрязнений.'
where id = 14;
GO

UPDATE products SET description = 'Жесткий диск Seagate 7200 
 BarraCuda [ST1000DM010] оснащен совершающим в минуту 7200 оборотов
 шпинделем, что в лучшую сторону влияет на производительность работы
 накопителя с данными. Емкость же Seagate 7200 BarraCuda [ST1000DM010]
 равна 1 терабайту – весьма неплохо, если только Вы не собираетесь
 держать у себя в ПК соразмерный с крупным сетевым порталом файловый
 архив. Среднее время задержки описываемого HDD равно 4.16 мс, 
 что немного, а объем кэш-памяти составляет 64 мегабайта.\r\nСостоящий 
 из одной пластины накопитель весит всего 400 граммов и является при
 этом весьма компактным – габариты его равны 10.16x14.6x2 сантиметра.
 Радует и довольно высокая ударостойкость комплектующего, при работе
 которая составляет 80 G. Уровень шума агрегата невысок и колеблется 
 в пределах 23-24 дБ, так что шум его работы Вас точно не побеспокоит.
 Потребление электричества тоже на уровне: 5.3 ватта – нормальный 
 для HDD показатель.'
where id = 15;
GO

UPDATE products SET description = 'Оперативная память AMD Radeon
 R9 Gamer Series [R9S416G3206U2K] представляет из себя 16-гигабайтный 
 комплект, состоящий из пары 8-гигабайтных модулей DDR4. Набор может
 быть использован как при модернизации, так и в ходе сборки стационарного
 компьютера. Название памяти красноречиво: она предназначена для комплектации
 игровых системных блоков. Ничто не помешает вам использовать модули и в
 составе производительных компьютеров универсального класса.\r\nТактовая 
 частота оперативной памяти AMD Radeon R9 Gamer Series [R9S416G3206U2K] 
 равна 3200 МГц. Пропускная способность устройства – 25600 МБ/с. 
 Напряжение питания памяти повышено (по сравнению со стандартными для
 DDR4 1.2 В) на 0.15 В. CAS-латентность модулей – 16.\r\nКонструкцией 
 модулей предусмотрены радиаторы. Устройства теплоотвода имеют оригинальный
 дизайн. Прозрачность пластиковой упаковки комплекта позволит вам ознакомиться
 с внешним видом модулей без распаковки. Упаковка надежно защищает память от
 внешних воздействий в процессе транспортировки и хранения.'
where id = 16;
GO

UPDATE products SET description = 'Благодаря планшету Huawei Matepad вы сможете
 с интересом проводить время по дороге на работу или учебу, а также добавить 
 ярких красок свободному времяпрепровождению. Благодаря красочной и контрастной 
 IPS-матрице, а также разрешению в 2000x1200 пикселей при их плотности в 224
 ppi и диагонали в 10.4 дюйма Huawei Matepad позволит сполна наслаждаться 
 фильмами и Интернет-серфингом. А 8-ядерный процессор Kirin 820 и 4 Гб
 оперативной памяти позволят не тратить время и нервы на загрузку даже 
 «тяжелых» программ и приложений, сразу получая удовольствие от работы 
 с ними. При этом 128 Гб встроенной памяти позволят формировать внушительную 
 библиотеку медиафайлов. Благодаря фронтальной и тыловой камерам на 8 Мп
 каждая, а также наличию вспышки, вы сможете делать четкие селфи, а также яркие
 снимки даже ночью. Емкого аккумулятора в 7250 мАч хватит на срок до 12 ч 
 активной работы.\r\nИнтернет-соединение будет легко осуществляться посредством
 Wi-Fi, а наличие Bluetooth, встроенный слот для USB Type-C, а также поддержка 
 OTG-устройств позволят еще удобнее синхронизировать планшет с другими нужными 
 устройствами. Выполнен данный агрегат в насыщенном сером цвете. 
 Габариты планшета: 245.2x154.96x7.45 мм.'
where id = 17;
GO

UPDATE products SET description = 'Смартфон Xiaomi Redmi 9 в сине-зеленом корпусе
 из пластика приятно поразит будущего владельца своими возможностями. Его
 IPS-экран диагональю 6.53 дюйма имеет безрамочную конструкцию и разрешение
 2340x1080 пикселей. Безграничное изображение получается непревзойденно четким
 и детализированным. Защитное покрытие Corning Gorilla Glass 3 позаботится о
 целостности экрана. Благодаря модулю Google Pay владельцу устройства не
 придется носить с собой банковские карты, потому что покупки можно оплачивать
 непосредственно с телефона.\r\nВосьмиядерный процессор MediaTek Helio G80 
 сочетается с ускорителем Mali-G52 и 3 ГБ оперативной памяти. Такая конфигурация
 отвечает за возможность проходить самые насыщенные графикой игры. Сканеры лица
 и отпечатков пальцев отвечают за возможность сохранить личные данные и платежные
 инструменты в конфиденциальности. Все это делает смартфон Xiaomi Redmi 9 лучшим
 выбором для самых требовательных и взыскательных пользователей.'
where id = 18;
GO

UPDATE products SET description = 'Принтер лазерный HP LaserJet Pro - 
 превосходная модель для домашнего и офисного использования. Вам гарантированы 
 исключительная компактность прибора и стабильное профессиональное качество печати.
 Стильная белая расцветка корпуса позволит ему уместно смотреться на любом рабочем
 месте. Лазерная технология печати обеспечивает великолепное качество распечатки
 документов. Максимальный формат печати, поддерживаемый представленной моделью, - A4.
 Предусмотрена возможность распечатки изображений и документов как в черно-белом, 
 так и в цветном варианте.\r\nЛазерный принтер HP LaserJet Pro печатает со 
 скоростью 16-18 стр/мин. Максимальное разрешение черно-белой печати соответствует
 600x600 dpi. В модели используется картридж CF244A с ресурсом черно-белой печати,
 равным 1000 страницам. Выходной лоток рассчитан на 100 листов, а лоток подачи - 
 на 150 листов. Предусмотрена печать не только на обычной бумаге, но и на конвертах,
 наклейках и почтовых открытках. Габариты принтера соответствуют 189x346x159 мм.'
where id = 19;
GO

UPDATE products SET description = 'При установке систем видеонаблюдения требуется
 не забыть об устройстве, отвечающем за долгосрочное хранение отснятого
 видеоматериала. Одним из таких комплектующих элементов является 2 ТБ 
 жесткий диск WD Purple [WD20PURZ]. Представленная модель является надежным 
 винчестером, идеально подходящим для использования в системах видеонаблюдения
 круглосуточно. Технология WD AllFrame 4K, реализованная в данном жестком диске,
 позволит вам построить систему безопасности, которая полностью будет 
 удовлетворять потребностям вашего бизнеса.\r\nWD Purple [WD20PURZ] обладает
 улучшенной потоковой передачей, при которой сокращается количество ошибок,
 устраняется проблема пикселизации картинки и сбои при записи. Данная модель
 имеет внушительный объем, равняющийся 2 ТБ. Для быстрого доступа к наиболее
 часто запрашиваемой информации предусмотрена кэш-память объемом 64 МБ. 
 Скорость вращения шпинделя в этой модели достигает 5400 rpm, что способствует
 хорошей работе винчестера без сбоев и подвисаний. Используется интерфейс SATA III.'
where id = 20;
GO

UPDATE products SET description = 'Броское название и эффектный дизайн – 
 этим отличается материнская плата MSI B450M MORTAR MAX. Это неудивительно,
 ведь речь идет о системной плате, предназначенной для сборки игрового
 системного блока. Данную возможность можно реализовать, несмотря на
 компактность платы. Модель, имеющая форму квадрата со сторонами 24.4 см, 
 соответствует форм-фактору Micro-ATX. Одним из преимуществ устройства 
 является поддержка технологии CrossFire X. Одновременно можно использовать
 два видеоадаптера. Максимально допустимый объем оперативной памяти – 64 ГБ.
 Частота памяти может достигать 4133 МГц.\r\nПлата MSI B450M MORTAR MAX
 позволяет обеспечить высокую скорость работы с информацией. Вы сможете 
 задействовать два накопителя M.2. Портов SATA – 4. Поддерживаются RAID 0, 1 и 10.
 Формат интегрированного звука – 7.1. За обмен данными с сетью отвечает гигабитный
 адаптер Realtek RTL8111H-CG.'
where id = 21;
GO

UPDATE products SET description = '12-ядерный процессор AMD Ryzen 9 5900X 
 BOX – устройство высокого класса, рассчитанное на функционирование в составе 
 производительных игровых ПК. Модель также подходит для «участия» в сборке 
 системного блока, активно используемого для работы с мультимедиа-данными.
 Не вызовут сложностей и стандартные условия эксплуатации (например –
 работа в Интернете и с офисным программным обеспечением).\r\nПроцессор
 AMD Ryzen 9 5900X BOX характеризуется базовой частотой 3700 МГц. Частота 
 в турборежиме может достигать 4800 МГц. Преимуществом устройства является
 значительный (64 МБ) объем кеш-памяти 3-го уровня. Процессор не имеет 
 графического ядра.\r\nТип поставки процессора – BOX. В данном случае
 это означает наличие только коробки и документации. Выбор системы охлаждения 
 (кулера или СВО) предоставлен пользователю. TDP процессора – 105 Вт.'
where id = 22;
GO

UPDATE products SET description = 'Монитор Samsung F24G35TFWI [LF24G35TFWIXCI] 
 с экраном диагональю 24 дюйма можно использовать для трансляции вертикального и 
 горизонтального изображения. Частота обновления – 144 Гц – указывает на
 исключительную плавность смены изображения даже при самых динамичных сценах. 
 Время отклика монитора на действия пользователя составляет всего 1 мс! За комфорт
 для зрения отвечают технологии Eye Saver Mode, минимизирующая синюю составляющую
 свечения, и Flicker Free, ликвидирующая мерцание. Еще одно преимущество этого 
 игрового монитора Samsung F24G35TFWI [LF24G35TFWIXCI] перед прочими – возможность 
 регулировать его высоту, наклон и поворот на усмотрение пользователя.'
where id = 23;
GO

UPDATE products SET description = 'Планшет Samsung Galaxy Tab S6 
 Lite является функциональным, надежным и очень удобным аппаратом, представленным
 в металлическом корпусе с диагональю экрана 10.4\". Встроенные 64 ГБ составляют
 надежную платформу для хранения цифровой информации. Поддержка емкости аккумулятора
 7040 мА ч дает возможностью проводить долгие часы за играми, не переживая о том, 
 что устройство быстро потеряет заряд. Функционирует устройство на основе Android 
 10.x, поэтому дает многочисленные преимущества для пользователей, которые ценят 
 скорость и высокую производительность.\r\nSamsung Galaxy Tab S6 Lite с емкостным 
 экраном мультитач использует электронное перо для того, чтобы вам было легче
 воплощать свои творческие задумки. Перо функционирует без подзарядки, поэтому 
 вам не придется беспокоиться о его подзарядке. Технология PLS поможет получить
 четкое изображение, обладающее разрешением 2000x1200. Устройство отличается 
 стабильностью работы приложений и высокоскоростным откликом благодаря 4 ГБ, 
 которые дает оперативный модуль.'
where id = 24;
GO

UPDATE products SET description = 'Видеокарта GeForce RTX 3080 Ti обеспечивает
 рекордную производительность для геймеров, работая на базе Ampere — 
 архитектуры NVIDIA RTX второго поколения. Она оснащена улучшенными ядрами RT 
 и тензорными ядрами, потоковыми мультипроцессорами и высокоскоростной памятью 
 G6X для потрясающих игровых возможностей.'
where id = 25;
GO

UPDATE products SET description = 'Материнская плата GIGABYTE B550 AORUS 
 ELITE V2 подходит для создания производительного системного блока. Вы сможете 
 сконструировать мощную игровую систему, мультимедийный ПК или универсальную 
 рабочую станцию. Особенностью платы является конструкция панели ввода/вывода,
 не требующая установки заглушки. Каждый из портов имеет соответствующее обозначение.
 \r\nПлата GIGABYTE B550 AORUS ELITE V2 имеет 4 слота расширения – 
 3 PCI-E x16 и 1 PCI-E x1. Поддержка NVMe позволяет задействовать
 скоростные SSD. Максимально допустимый объем памяти равен 128 ГБ. 
 Процессорный сокет – AM4. В оснащение платы входят звуковой адаптер 
 7.1 и сетевой адаптер, поддерживающий скорость соединения 2500 Мбит/с.
 Форм-фактор модели – Standard-ATX. Плата имеет стандартные размеры – 
 305x244 мм. Особенность внешнего вида устройства – наличие подсветки.'
where id = 26;
GO

UPDATE products SET description = 'Смартфон Apple iPhone 11 представлен в красном корпусе 
 светлого оттенка с диагональю экрана 6.1\". Встроенные 64 ГБ позволяют снять
 ограничения касательно сохранения цифровых сведений: вы сможете снимать видео и
 фото, не беспокоясь об оставшихся гигабайтах. Шестиядерная конфигурация процессора
 A13 Bionic в сочетании с 4 ГБ оперативного модуля способствует высокоскоростной
 загрузке приложений с отсутствием задержек. Аккумулятор емкостью 3110 мА·ч 
 отвечает за длительную автономную работу аппарата.\r\nДвойная камера 12+12 Мп
 сочетает в себе широкоугольную и сверхширокоугольную с большим набором функций, 
 чтобы вы могли получать только первоклассные снимки и видеоролики. Apple iPhone
 11 поддерживает установку одной карты SIM, что необходимо учитывать при выборе
 этого аппарата. Технология IPS, реализованная в экране, выводит изображение в
 разрешении 1792x828. Модули 3G, 4G, технология NFC, а также система геолокации 
 GPS дают огромные возможности для пользователя, который стремится поспеть за всеми
 техническими инновациями.'
where id = 27;
GO

UPDATE products SET description = 'Жесткий диск Seagate 5900 SkyHawk можно
 использовать в небольших и весьма крупных системах видеонаблюдения, так как 
 он отличается завидным 4-терабайтным объемом и поддержкой RAID-массивов. 
 Вращающийся на частоте 5900 rpm шпиндель дает Seagate 5900 SkyHawk потреблять
 немного электроэнергии и создавать минимум шума. Кэш-память в 64 мегабайта
 добавляет накопителю производительности.\r\nСкорость, на которой HDD осуществляет
 передачу данных, может достигать в секунду 190 мегабайт – характеристика даже с 
 запасом. Не отстает и интерфейс – SATA III тоже отличает высокая (6 Гбит/с) 
 пропускная способность. Диск имеет небольшую, равную 2.61 сантиметра, толщину.'
where id = 28;
GO

UPDATE products SET description = 'Оперативная память Kingston HyperX
 FURY Black [HX437C19FB3K2/32] представлена в виде комплекта из двух устройств,
 использование которых поможет существенно повысить уровень производительности 
 и быстродействия мощных ПК. Модули работают на частоте 3733 МГц с пропускной 
 способностью 29800 Мбит/с и таймингами 19-23-23-32. Напряжение питания 1.35 В 
 гарантирует экономичное потребление электроэнергии. Для эффективного отведения
 тепла на модулях Kingston HyperX FURY Black установлен низкопрофильный 
 металлический радиатор с классической черной расцветкой, который будет 
 лаконично смотреться в любой сборке.'
where id = 29;
GO

UPDATE products SET description = 'Принадлежащий к 10-му поколению 6-ядерный 
 процессор Intel Core i5-10400 BOX станет отличным выбором для пользователей, 
 которые хотят сконструировать надежную и высокопроизводительную систему. 
 Модель, в частности, подойдет для оснащения игрового компьютера. Уровень 
 скорости обработки данных, обеспечиваемый устройством, достаточен для решения
 большинства задач дома и в офисе. Процессор обладает 12-мегабайтной кеш-памятью 
 3-го уровня. Объем кеш-памяти L2 – 1.5 МБ. Базовая частота процессора равна 2900 МГц. 
 Максимальная частота в турборежиме – 4300 МГц.\r\nПроцессор Intel Core i5-10400 BOX
 имеет интегрированное видеоядро Intel UHD Graphics 630, максимальная частота которого
 равна 1100 МГц. Совместимая память – DDR4. Объем памяти может достигать 128 ГБ.
 В комплектацию процессора входит оригинальный кулер Intel, который гарантирует
 стабильность функционирования устройства в любых режимах. Температура процессора
 (TDP которого составляет 65 Вт) в процессе работы может достигать 100 °C. 
 Упаковка модели – эффектно выглядящая коробка.'
where id = 30;
GO